"Please Donate" = "Παρακαλώ Κάνετε Δωρεά";

"Donate!" = "Δωρεά!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Χρειάστηκαν πολλά ξενύχτια για την ανάπτυξη αυτής της εφαρμογής. Αν σας αρέσει, παρακαλώ σκεφτείτε να κάνετε μια δωρεά στον δημιουργό αυτού του λογισμικού. Θα βοηθήσει να γίνει το Cyberduck ακόμα καλύτερο!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Ως συντελεστής για το Cyberduck, λαμβάνετε κλειδί δωρεάς που απενεργοποιεί αυτή την προτροπή.";

"Thank you for using Cyberduck!" = "Ευχαριστώ που χρησιμοποιείτε το Cyberduck!";

"Later" = "Αργότερα";

"Don't show again for this version." = "Να μην εμφανιστεί ξανά γι' αυτή την έκδοση.";

"The payment can be made simply and safely using Paypal. You don't need to open an account." = "Η πληρωμή μπορεί να γίνει απλά και με ασφάλεια με χρήση του Paypal. Δεν χρειάζεστε λογαριασμό.";

"Donation Key" = "Κλειδί Δωρεάς";

